#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
[0m[1mmodule.kube-hetzner.hcloud_network.k3s[0]: Refreshing state... [id=11370228][0m
[0m[1mmodule.kube-hetzner.data.hcloud_image.microos_arm_snapshot: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.random_password.rancher_bootstrap[0]: Refreshing state... [id=none][0m
[0m[1mmodule.kube-hetzner.hcloud_placement_group.control_plane[0]: Refreshing state... [id=1125109][0m
[0m[1mmodule.kube-hetzner.data.hcloud_ssh_keys.keys_by_selector[0]: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.data.hcloud_image.microos_x86_snapshot: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.hcloud_ssh_key.k3s[0]: Refreshing state... [id=101139328][0m
[0m[1mmodule.kube-hetzner.hcloud_firewall.k3s: Refreshing state... [id=2380691][0m
[0m[1mmodule.kube-hetzner.random_password.k3s_token: Refreshing state... [id=none][0m
[0m[1mmodule.kube-hetzner.hcloud_placement_group.agent[0]: Refreshing state... [id=1125108][0m
[0m[1mmodule.kube-hetzner.data.hcloud_ssh_keys.keys_by_selector[0]: Read complete after 0s[0m
[0m[1mmodule.kube-hetzner.data.hcloud_image.microos_arm_snapshot: Read complete after 0s[0m
[0m[1mmodule.kube-hetzner.data.hcloud_image.microos_x86_snapshot: Read complete after 0s[0m
[0m[1mmodule.kube-hetzner.data.hcloud_network.k3s: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.data.hcloud_network.k3s: Read complete after 0s [name=kube-baphomet][0m
[0m[1mmodule.kube-hetzner.hcloud_network_subnet.agent[0]: Refreshing state... [id=11370228-10.0.0.0/16][0m
[0m[1mmodule.kube-hetzner.hcloud_network_subnet.agent[2]: Refreshing state... [id=11370228-10.2.0.0/16][0m
[0m[1mmodule.kube-hetzner.hcloud_network_subnet.agent[1]: Refreshing state... [id=11370228-10.1.0.0/16][0m
[0m[1mmodule.kube-hetzner.hcloud_network_subnet.control_plane[1]: Refreshing state... [id=11370228-10.254.0.0/16][0m
[0m[1mmodule.kube-hetzner.hcloud_network_subnet.control_plane[0]: Refreshing state... [id=11370228-10.255.0.0/16][0m
[0m[1mmodule.kube-hetzner.hcloud_network_subnet.control_plane[2]: Refreshing state... [id=11370228-10.253.0.0/16][0m
[0m[1mmodule.kube-hetzner.module.agents["2-0-worker-2"].random_string.identity_file: Refreshing state... [id=urvougqof1w17cod8tb9][0m
[0m[1mmodule.kube-hetzner.module.agents["1-0-worker-1"].random_string.identity_file: Refreshing state... [id=u4e4g031nr87jie5tauq][0m
[0m[1mmodule.kube-hetzner.module.agents["0-0-worker-0"].random_string.identity_file: Refreshing state... [id=1xhj21b4lvipyug7rk81][0m
[0m[1mmodule.kube-hetzner.module.agents["2-0-worker-2"].random_string.server: Refreshing state... [id=jds][0m
[0m[1mmodule.kube-hetzner.module.agents["1-0-worker-1"].random_string.server: Refreshing state... [id=qmd][0m
[0m[1mmodule.kube-hetzner.module.control_planes["2-0-control-plane-2"].random_string.identity_file: Refreshing state... [id=uqgn66gq6m2azl4x29kd][0m
[0m[1mmodule.kube-hetzner.module.control_planes["1-0-control-plane-1"].random_string.identity_file: Refreshing state... [id=fji8u4q38lhh14f2cp4w][0m
[0m[1mmodule.kube-hetzner.module.agents["0-0-worker-0"].random_string.server: Refreshing state... [id=yze][0m
[0m[1mmodule.kube-hetzner.module.control_planes["0-0-control-plane-0"].random_string.identity_file: Refreshing state... [id=738odnfq33zio688pf0p][0m
[0m[1mmodule.kube-hetzner.module.control_planes["1-0-control-plane-1"].random_string.server: Refreshing state... [id=jbp][0m
[0m[1mmodule.kube-hetzner.module.control_planes["0-0-control-plane-0"].random_string.server: Refreshing state... [id=idz][0m
[0m[1mmodule.kube-hetzner.module.control_planes["2-0-control-plane-2"].random_string.server: Refreshing state... [id=gwe][0m
[0m[1mmodule.kube-hetzner.module.agents["2-0-worker-2"].data.cloudinit_config.config: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.module.agents["2-0-worker-2"].data.cloudinit_config.config: Read complete after 0s [id=1685486845][0m
[0m[1mmodule.kube-hetzner.module.agents["1-0-worker-1"].data.cloudinit_config.config: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.module.agents["0-0-worker-0"].data.cloudinit_config.config: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.module.agents["1-0-worker-1"].data.cloudinit_config.config: Read complete after 0s [id=1954988875][0m
[0m[1mmodule.kube-hetzner.module.agents["0-0-worker-0"].data.cloudinit_config.config: Read complete after 0s [id=1058471852][0m
[0m[1mmodule.kube-hetzner.module.agents["1-0-worker-1"].hcloud_server.server: Refreshing state... [id=107292780][0m
[0m[1mmodule.kube-hetzner.module.agents["2-0-worker-2"].hcloud_server.server: Refreshing state... [id=107292779][0m
[0m[1mmodule.kube-hetzner.module.control_planes["2-0-control-plane-2"].data.cloudinit_config.config: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.module.control_planes["0-0-control-plane-0"].data.cloudinit_config.config: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.module.control_planes["1-0-control-plane-1"].data.cloudinit_config.config: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.module.agents["0-0-worker-0"].hcloud_server.server: Refreshing state... [id=107292777][0m
[0m[1mmodule.kube-hetzner.module.control_planes["2-0-control-plane-2"].data.cloudinit_config.config: Read complete after 0s [id=1266612182][0m
[0m[1mmodule.kube-hetzner.module.control_planes["1-0-control-plane-1"].data.cloudinit_config.config: Read complete after 0s [id=870780212][0m
[0m[1mmodule.kube-hetzner.module.control_planes["0-0-control-plane-0"].data.cloudinit_config.config: Read complete after 0s [id=4222838495][0m
[0m[1mmodule.kube-hetzner.module.control_planes["2-0-control-plane-2"].hcloud_server.server: Refreshing state... [id=107292778][0m
[0m[1mmodule.kube-hetzner.module.control_planes["0-0-control-plane-0"].hcloud_server.server: Refreshing state... [id=107292781][0m
[0m[1mmodule.kube-hetzner.module.control_planes["1-0-control-plane-1"].hcloud_server.server: Refreshing state... [id=107292776][0m
[0m[1mmodule.kube-hetzner.data.github_release.kured[0]: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.data.github_release.hetzner_csi[0]: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.data.github_release.hetzner_ccm[0]: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.data.github_release.kured[0]: Read complete after 0s [id=203405526][0m
[0m[1mmodule.kube-hetzner.data.github_release.hetzner_csi[0]: Read complete after 0s [id=237686054][0m
[0m[1mmodule.kube-hetzner.data.github_release.hetzner_ccm[0]: Read complete after 0s [id=229419124][0m
[0m[1mmodule.kube-hetzner.local_file.kustomization_backup[0]: Refreshing state... [id=ef162be06bb944e4d85518dc5e66750bbcc0e722][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
[31m-[0m/[32m+[0m destroy and then create replacement[0m

Terraform will perform the following actions:

[1m  # aws_route53_record.agent_dns_v4["worker-1"][0m will be created
[0m  [32m+[0m[0m resource "aws_route53_record" "agent_dns_v4" {
      [32m+[0m[0m allow_overwrite = (known after apply)
      [32m+[0m[0m fqdn            = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m name            = "worker-1.baphomet.cloud"
      [32m+[0m[0m records         = (known after apply)
      [32m+[0m[0m ttl             = 300
      [32m+[0m[0m type            = "A"
      [32m+[0m[0m zone_id         = "Z00476003F8RX1KPNHHY4"
    }

[1m  # aws_route53_record.agent_dns_v4["worker-2"][0m will be created
[0m  [32m+[0m[0m resource "aws_route53_record" "agent_dns_v4" {
      [32m+[0m[0m allow_overwrite = (known after apply)
      [32m+[0m[0m fqdn            = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m name            = "worker-2.baphomet.cloud"
      [32m+[0m[0m records         = (known after apply)
      [32m+[0m[0m ttl             = 300
      [32m+[0m[0m type            = "A"
      [32m+[0m[0m zone_id         = "Z00476003F8RX1KPNHHY4"
    }

[1m  # aws_route53_record.agent_dns_v6["worker-1"][0m will be created
[0m  [32m+[0m[0m resource "aws_route53_record" "agent_dns_v6" {
      [32m+[0m[0m allow_overwrite = (known after apply)
      [32m+[0m[0m fqdn            = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m name            = "worker-1.baphomet.cloud"
      [32m+[0m[0m records         = (known after apply)
      [32m+[0m[0m ttl             = 300
      [32m+[0m[0m type            = "AAAA"
      [32m+[0m[0m zone_id         = "Z00476003F8RX1KPNHHY4"
    }

[1m  # aws_route53_record.agent_dns_v6["worker-2"][0m will be created
[0m  [32m+[0m[0m resource "aws_route53_record" "agent_dns_v6" {
      [32m+[0m[0m allow_overwrite = (known after apply)
      [32m+[0m[0m fqdn            = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m name            = "worker-2.baphomet.cloud"
      [32m+[0m[0m records         = (known after apply)
      [32m+[0m[0m ttl             = 300
      [32m+[0m[0m type            = "AAAA"
      [32m+[0m[0m zone_id         = "Z00476003F8RX1KPNHHY4"
    }

[1m  # aws_route53_record.cluster_base_dns_v4[0m will be created
[0m  [32m+[0m[0m resource "aws_route53_record" "cluster_base_dns_v4" {
      [32m+[0m[0m allow_overwrite = (known after apply)
      [32m+[0m[0m fqdn            = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m name            = "baphomet.cloud"
      [32m+[0m[0m records         = (known after apply)
      [32m+[0m[0m ttl             = 300
      [32m+[0m[0m type            = "A"
      [32m+[0m[0m zone_id         = "Z00476003F8RX1KPNHHY4"
    }

[1m  # aws_route53_record.cluster_base_dns_v6[0m will be created
[0m  [32m+[0m[0m resource "aws_route53_record" "cluster_base_dns_v6" {
      [32m+[0m[0m allow_overwrite = (known after apply)
      [32m+[0m[0m fqdn            = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m name            = "baphomet.cloud"
      [32m+[0m[0m records         = (known after apply)
      [32m+[0m[0m ttl             = 300
      [32m+[0m[0m type            = "AAAA"
      [32m+[0m[0m zone_id         = "Z00476003F8RX1KPNHHY4"
    }

[1m  # aws_route53_record.cluster_wildcard_dns_v4[0m will be created
[0m  [32m+[0m[0m resource "aws_route53_record" "cluster_wildcard_dns_v4" {
      [32m+[0m[0m allow_overwrite = (known after apply)
      [32m+[0m[0m fqdn            = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m name            = "*.baphomet.cloud"
      [32m+[0m[0m records         = (known after apply)
      [32m+[0m[0m ttl             = 300
      [32m+[0m[0m type            = "A"
      [32m+[0m[0m zone_id         = "Z00476003F8RX1KPNHHY4"
    }

[1m  # aws_route53_record.cluster_wildcard_dns_v6[0m will be created
[0m  [32m+[0m[0m resource "aws_route53_record" "cluster_wildcard_dns_v6" {
      [32m+[0m[0m allow_overwrite = (known after apply)
      [32m+[0m[0m fqdn            = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m name            = "*.baphomet.cloud"
      [32m+[0m[0m records         = (known after apply)
      [32m+[0m[0m ttl             = 300
      [32m+[0m[0m type            = "AAAA"
      [32m+[0m[0m zone_id         = "Z00476003F8RX1KPNHHY4"
    }

[1m  # aws_route53_record.control_plane_dns["cp-1"][0m will be created
[0m  [32m+[0m[0m resource "aws_route53_record" "control_plane_dns" {
      [32m+[0m[0m allow_overwrite = (known after apply)
      [32m+[0m[0m fqdn            = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m name            = "cp-1.baphomet.cloud"
      [32m+[0m[0m records         = (known after apply)
      [32m+[0m[0m ttl             = 300
      [32m+[0m[0m type            = "A"
      [32m+[0m[0m zone_id         = "Z00476003F8RX1KPNHHY4"
    }

[1m  # aws_route53_record.control_plane_dns["cp-2"][0m will be created
[0m  [32m+[0m[0m resource "aws_route53_record" "control_plane_dns" {
      [32m+[0m[0m allow_overwrite = (known after apply)
      [32m+[0m[0m fqdn            = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m name            = "cp-2.baphomet.cloud"
      [32m+[0m[0m records         = (known after apply)
      [32m+[0m[0m ttl             = 300
      [32m+[0m[0m type            = "A"
      [32m+[0m[0m zone_id         = "Z00476003F8RX1KPNHHY4"
    }

[1m  # aws_route53_record.control_plane_dns["cp-3"][0m will be created
[0m  [32m+[0m[0m resource "aws_route53_record" "control_plane_dns" {
      [32m+[0m[0m allow_overwrite = (known after apply)
      [32m+[0m[0m fqdn            = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m name            = "cp-3.baphomet.cloud"
      [32m+[0m[0m records         = (known after apply)
      [32m+[0m[0m ttl             = 300
      [32m+[0m[0m type            = "A"
      [32m+[0m[0m zone_id         = "Z00476003F8RX1KPNHHY4"
    }

[1m  # aws_route53_record.rancher_dns_v4[0m will be created
[0m  [32m+[0m[0m resource "aws_route53_record" "rancher_dns_v4" {
      [32m+[0m[0m allow_overwrite = (known after apply)
      [32m+[0m[0m fqdn            = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m name            = "rancher.baphomet.cloud"
      [32m+[0m[0m records         = (known after apply)
      [32m+[0m[0m ttl             = 300
      [32m+[0m[0m type            = "A"
      [32m+[0m[0m zone_id         = "Z00476003F8RX1KPNHHY4"
    }

[1m  # aws_route53_record.rancher_dns_v6[0m will be created
[0m  [32m+[0m[0m resource "aws_route53_record" "rancher_dns_v6" {
      [32m+[0m[0m allow_overwrite = (known after apply)
      [32m+[0m[0m fqdn            = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m name            = "rancher.baphomet.cloud"
      [32m+[0m[0m records         = (known after apply)
      [32m+[0m[0m ttl             = 300
      [32m+[0m[0m type            = "AAAA"
      [32m+[0m[0m zone_id         = "Z00476003F8RX1KPNHHY4"
    }

[1m  # module.kube-hetzner.local_file.kustomization_backup[0][0m will be created
[0m  [32m+[0m[0m resource "local_file" "kustomization_backup" {
      [32m+[0m[0m content              = (sensitive value)
      [32m+[0m[0m content_base64sha256 = (known after apply)
      [32m+[0m[0m content_base64sha512 = (known after apply)
      [32m+[0m[0m content_md5          = (known after apply)
      [32m+[0m[0m content_sha1         = (known after apply)
      [32m+[0m[0m content_sha256       = (known after apply)
      [32m+[0m[0m content_sha512       = (known after apply)
      [32m+[0m[0m directory_permission = "0777"
      [32m+[0m[0m file_permission      = "600"
      [32m+[0m[0m filename             = "kube-baphomet_kustomization_backup.yaml"
      [32m+[0m[0m id                   = (known after apply)
    }

[1m  # module.kube-hetzner.local_sensitive_file.kubeconfig[0][0m will be created
[0m  [32m+[0m[0m resource "local_sensitive_file" "kubeconfig" {
      [32m+[0m[0m content              = (sensitive value)
      [32m+[0m[0m content_base64sha256 = (known after apply)
      [32m+[0m[0m content_base64sha512 = (known after apply)
      [32m+[0m[0m content_md5          = (known after apply)
      [32m+[0m[0m content_sha1         = (known after apply)
      [32m+[0m[0m content_sha256       = (known after apply)
      [32m+[0m[0m content_sha512       = (known after apply)
      [32m+[0m[0m directory_permission = "0700"
      [32m+[0m[0m file_permission      = "600"
      [32m+[0m[0m filename             = "kube-baphomet_kubeconfig.yaml"
      [32m+[0m[0m id                   = (known after apply)
    }

[1m  # module.kube-hetzner.null_resource.agent_config["0-0-worker-0"][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "agent_config" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "agent_id" = (known after apply)
          [32m+[0m[0m "config"   = (sensitive value)
        }
    }

[1m  # module.kube-hetzner.null_resource.agent_config["1-0-worker-1"][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "agent_config" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "agent_id" = (known after apply)
          [32m+[0m[0m "config"   = (sensitive value)
        }
    }

[1m  # module.kube-hetzner.null_resource.agent_config["2-0-worker-2"][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "agent_config" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "agent_id" = (known after apply)
          [32m+[0m[0m "config"   = (sensitive value)
        }
    }

[1m  # module.kube-hetzner.null_resource.agents["0-0-worker-0"][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "agents" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "agent_id" = (known after apply)
        }
    }

[1m  # module.kube-hetzner.null_resource.agents["1-0-worker-1"][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "agents" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "agent_id" = (known after apply)
        }
    }

[1m  # module.kube-hetzner.null_resource.agents["2-0-worker-2"][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "agents" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "agent_id" = (known after apply)
        }
    }

[1m  # module.kube-hetzner.null_resource.authentication_config["0-0-control-plane-0"][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "authentication_config" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "authentication_config" = "da39a3ee5e6b4b0d3255bfef95601890afd80709"
          [32m+[0m[0m "control_plane_id"      = (known after apply)
        }
    }

[1m  # module.kube-hetzner.null_resource.authentication_config["1-0-control-plane-1"][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "authentication_config" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "authentication_config" = "da39a3ee5e6b4b0d3255bfef95601890afd80709"
          [32m+[0m[0m "control_plane_id"      = (known after apply)
        }
    }

[1m  # module.kube-hetzner.null_resource.authentication_config["2-0-control-plane-2"][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "authentication_config" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "authentication_config" = "da39a3ee5e6b4b0d3255bfef95601890afd80709"
          [32m+[0m[0m "control_plane_id"      = (known after apply)
        }
    }

[1m  # module.kube-hetzner.null_resource.control_plane_config["0-0-control-plane-0"][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "control_plane_config" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "config"           = (sensitive value)
          [32m+[0m[0m "control_plane_id" = (known after apply)
        }
    }

[1m  # module.kube-hetzner.null_resource.control_plane_config["1-0-control-plane-1"][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "control_plane_config" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "config"           = (sensitive value)
          [32m+[0m[0m "control_plane_id" = (known after apply)
        }
    }

[1m  # module.kube-hetzner.null_resource.control_plane_config["2-0-control-plane-2"][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "control_plane_config" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "config"           = (sensitive value)
          [32m+[0m[0m "control_plane_id" = (known after apply)
        }
    }

[1m  # module.kube-hetzner.null_resource.control_planes["0-0-control-plane-0"][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "control_planes" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "control_plane_id" = (known after apply)
        }
    }

[1m  # module.kube-hetzner.null_resource.control_planes["1-0-control-plane-1"][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "control_planes" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "control_plane_id" = (known after apply)
        }
    }

[1m  # module.kube-hetzner.null_resource.control_planes["2-0-control-plane-2"][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "control_planes" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "control_plane_id" = (known after apply)
        }
    }

[1m  # module.kube-hetzner.null_resource.first_control_plane[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "first_control_plane" {
      [32m+[0m[0m id = (known after apply)
    }

[1m  # module.kube-hetzner.null_resource.kustomization[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "kustomization" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "ccm_use_helm"     = "false"
          [32m+[0m[0m "helm_values_yaml" = (sensitive value)
          [32m+[0m[0m "options"          = <<-EOT
                period=5m
                post-reboot-node-labels=kured=done
                pre-reboot-node-labels=kured=rebooting
                reboot-command=/usr/bin/systemctl reboot
                reboot-sentinel=/sentinel/reboot-required
            EOT
          [32m+[0m[0m "versions"         = <<-EOT
                v1.31
                N/A
                v1.32.0
                N/A
                N/A
                N/A
                N/A
                1.17.0
                N/A
                N/A
                N/A
                *
                *
                *
                *
                v0.14.2
            EOT
        }
    }

[1m  # module.kube-hetzner.null_resource.kustomization_user["letsencrypt/kustomization.yaml.tpl"][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "kustomization_user" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "manifest_sha1" = "6ef770e5bd93f34a39c269f200a5e8bffdb7cd10"
        }
    }

[1m  # module.kube-hetzner.null_resource.kustomization_user_deploy[0][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "kustomization_user_deploy" {
      [32m+[0m[0m id = (known after apply)
    }

[1m  # module.kube-hetzner.ssh_sensitive_resource.kubeconfig[0m will be created
[0m  [32m+[0m[0m resource "ssh_sensitive_resource" "kubeconfig" {
      [32m+[0m[0m agent                              = (sensitive value)
      [32m+[0m[0m bastion_port                       = "22"
      [32m+[0m[0m commands                           = [
          [32m+[0m[0m "cat /etc/rancher/k3s/k3s.yaml",
        ]
      [32m+[0m[0m commands_after_file_changes        = true
      [32m+[0m[0m host                               = (known after apply)
      [32m+[0m[0m id                                 = (known after apply)
      [32m+[0m[0m ignore_no_supported_methods_remain = false
      [32m+[0m[0m port                               = "22"
      [32m+[0m[0m private_key                        = (sensitive value)
      [32m+[0m[0m result                             = (sensitive value)
      [32m+[0m[0m retry_delay                        = "10s"
      [32m+[0m[0m timeout                            = "15m"
      [32m+[0m[0m user                               = "root"
      [32m+[0m[0m when                               = "create"
    }

[1m  # module.kube-hetzner.module.agents["0-0-worker-0"].hcloud_server.server[0m is tainted, so must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "hcloud_server" "server" {
      [32m+[0m[0m backup_window              = (known after apply)
      [33m~[0m[0m datacenter                 = "hel1-dc2" -> (known after apply)
      [33m~[0m[0m id                         = "107292777" -> (known after apply)
      [33m~[0m[0m ipv4_address               = "65.108.83.235" -> (known after apply)
      [33m~[0m[0m ipv6_address               = "2a01:4f9:c013:b38e::1" -> (known after apply)
      [33m~[0m[0m ipv6_network               = "2a01:4f9:c013:b38e::/64" -> (known after apply)
        name                       = "kube-baphomet-worker-0-yze"
      [33m~[0m[0m primary_disk_size          = 40 -> (known after apply)
      [33m~[0m[0m status                     = "running" -> (known after apply)
        [90m# (15 unchanged attributes hidden)[0m[0m

      [31m-[0m[0m network {
          [31m-[0m[0m alias_ips   = [] [90m-> null[0m[0m
          [31m-[0m[0m ip          = "10.0.0.101" [90m-> null[0m[0m
          [31m-[0m[0m mac_address = "86:00:00:a8:fc:35" [90m-> null[0m[0m
          [31m-[0m[0m network_id  = 11370228 [90m-> null[0m[0m
        }
      [32m+[0m[0m network {
          [32m+[0m[0m alias_ips   = []
          [32m+[0m[0m ip          = "10.0.0.101"
          [32m+[0m[0m mac_address = (known after apply)
          [32m+[0m[0m network_id  = 11370228
        }

      [31m-[0m[0m public_net {
          [31m-[0m[0m ipv4         = 0 [90m-> null[0m[0m
          [31m-[0m[0m ipv4_enabled = true [90m-> null[0m[0m
          [31m-[0m[0m ipv6         = 0 [90m-> null[0m[0m
          [31m-[0m[0m ipv6_enabled = true [90m-> null[0m[0m
        }
      [32m+[0m[0m public_net {
          [32m+[0m[0m ipv4         = (known after apply)
          [32m+[0m[0m ipv4_enabled = true
          [32m+[0m[0m ipv6         = (known after apply)
          [32m+[0m[0m ipv6_enabled = true
        }
    }

[1m  # module.kube-hetzner.module.agents["0-0-worker-0"].null_resource.os_upgrade_toggle[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "os_upgrade_toggle" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "os_upgrade_state" = "enabled"
          [32m+[0m[0m "server_id"        = (known after apply)
        }
    }

[1m  # module.kube-hetzner.module.agents["0-0-worker-0"].null_resource.registries[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "registries" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "registries" = " "
        }
    }

[1m  # module.kube-hetzner.module.agents["0-0-worker-0"].null_resource.zram[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "zram" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "zram_size" = [90mnull[0m[0m
        }
    }

[1m  # module.kube-hetzner.module.agents["1-0-worker-1"].hcloud_server.server[0m is tainted, so must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "hcloud_server" "server" {
      [32m+[0m[0m backup_window              = (known after apply)
      [33m~[0m[0m datacenter                 = "nbg1-dc3" -> (known after apply)
      [33m~[0m[0m id                         = "107292780" -> (known after apply)
      [33m~[0m[0m ipv4_address               = "188.245.148.8" -> (known after apply)
      [33m~[0m[0m ipv6_address               = "2a01:4f8:c2c:5aff::1" -> (known after apply)
      [33m~[0m[0m ipv6_network               = "2a01:4f8:c2c:5aff::/64" -> (known after apply)
        name                       = "kube-baphomet-worker-1-qmd"
      [33m~[0m[0m primary_disk_size          = 80 -> (known after apply)
      [33m~[0m[0m status                     = "running" -> (known after apply)
        [90m# (15 unchanged attributes hidden)[0m[0m

      [31m-[0m[0m network {
          [31m-[0m[0m alias_ips   = [] [90m-> null[0m[0m
          [31m-[0m[0m ip          = "10.1.0.101" [90m-> null[0m[0m
          [31m-[0m[0m mac_address = "86:00:00:a8:fc:3a" [90m-> null[0m[0m
          [31m-[0m[0m network_id  = 11370228 [90m-> null[0m[0m
        }
      [32m+[0m[0m network {
          [32m+[0m[0m alias_ips   = []
          [32m+[0m[0m ip          = "10.1.0.101"
          [32m+[0m[0m mac_address = (known after apply)
          [32m+[0m[0m network_id  = 11370228
        }

      [31m-[0m[0m public_net {
          [31m-[0m[0m ipv4         = 0 [90m-> null[0m[0m
          [31m-[0m[0m ipv4_enabled = true [90m-> null[0m[0m
          [31m-[0m[0m ipv6         = 0 [90m-> null[0m[0m
          [31m-[0m[0m ipv6_enabled = true [90m-> null[0m[0m
        }
      [32m+[0m[0m public_net {
          [32m+[0m[0m ipv4         = (known after apply)
          [32m+[0m[0m ipv4_enabled = true
          [32m+[0m[0m ipv6         = (known after apply)
          [32m+[0m[0m ipv6_enabled = true
        }
    }

[1m  # module.kube-hetzner.module.agents["1-0-worker-1"].null_resource.os_upgrade_toggle[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "os_upgrade_toggle" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "os_upgrade_state" = "enabled"
          [32m+[0m[0m "server_id"        = (known after apply)
        }
    }

[1m  # module.kube-hetzner.module.agents["1-0-worker-1"].null_resource.registries[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "registries" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "registries" = " "
        }
    }

[1m  # module.kube-hetzner.module.agents["1-0-worker-1"].null_resource.zram[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "zram" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "zram_size" = [90mnull[0m[0m
        }
    }

[1m  # module.kube-hetzner.module.agents["2-0-worker-2"].hcloud_server.server[0m is tainted, so must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "hcloud_server" "server" {
      [32m+[0m[0m backup_window              = (known after apply)
      [33m~[0m[0m datacenter                 = "fsn1-dc14" -> (known after apply)
      [33m~[0m[0m id                         = "107292779" -> (known after apply)
      [33m~[0m[0m ipv4_address               = "195.201.238.37" -> (known after apply)
      [33m~[0m[0m ipv6_address               = "2a01:4f8:c012:32a0::1" -> (known after apply)
      [33m~[0m[0m ipv6_network               = "2a01:4f8:c012:32a0::/64" -> (known after apply)
        name                       = "kube-baphomet-worker-2-jds"
      [33m~[0m[0m primary_disk_size          = 80 -> (known after apply)
      [33m~[0m[0m status                     = "running" -> (known after apply)
        [90m# (15 unchanged attributes hidden)[0m[0m

      [31m-[0m[0m network {
          [31m-[0m[0m alias_ips   = [] [90m-> null[0m[0m
          [31m-[0m[0m ip          = "10.2.0.101" [90m-> null[0m[0m
          [31m-[0m[0m mac_address = "86:00:00:a8:fc:33" [90m-> null[0m[0m
          [31m-[0m[0m network_id  = 11370228 [90m-> null[0m[0m
        }
      [32m+[0m[0m network {
          [32m+[0m[0m alias_ips   = []
          [32m+[0m[0m ip          = "10.2.0.101"
          [32m+[0m[0m mac_address = (known after apply)
          [32m+[0m[0m network_id  = 11370228
        }

      [31m-[0m[0m public_net {
          [31m-[0m[0m ipv4         = 0 [90m-> null[0m[0m
          [31m-[0m[0m ipv4_enabled = true [90m-> null[0m[0m
          [31m-[0m[0m ipv6         = 0 [90m-> null[0m[0m
          [31m-[0m[0m ipv6_enabled = true [90m-> null[0m[0m
        }
      [32m+[0m[0m public_net {
          [32m+[0m[0m ipv4         = (known after apply)
          [32m+[0m[0m ipv4_enabled = true
          [32m+[0m[0m ipv6         = (known after apply)
          [32m+[0m[0m ipv6_enabled = true
        }
    }

[1m  # module.kube-hetzner.module.agents["2-0-worker-2"].null_resource.os_upgrade_toggle[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "os_upgrade_toggle" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "os_upgrade_state" = "enabled"
          [32m+[0m[0m "server_id"        = (known after apply)
        }
    }

[1m  # module.kube-hetzner.module.agents["2-0-worker-2"].null_resource.registries[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "registries" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "registries" = " "
        }
    }

[1m  # module.kube-hetzner.module.agents["2-0-worker-2"].null_resource.zram[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "zram" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "zram_size" = [90mnull[0m[0m
        }
    }

[1m  # module.kube-hetzner.module.control_planes["0-0-control-plane-0"].hcloud_server.server[0m is tainted, so must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "hcloud_server" "server" {
      [32m+[0m[0m backup_window              = (known after apply)
      [33m~[0m[0m datacenter                 = "fsn1-dc14" -> (known after apply)
      [33m~[0m[0m id                         = "107292781" -> (known after apply)
      [33m~[0m[0m ipv4_address               = "5.75.224.184" -> (known after apply)
      [33m~[0m[0m ipv6_address               = "2a01:4f8:c012:c0f1::1" -> (known after apply)
      [33m~[0m[0m ipv6_network               = "2a01:4f8:c012:c0f1::/64" -> (known after apply)
        name                       = "kube-baphomet-control-plane-0-idz"
      [33m~[0m[0m primary_disk_size          = 40 -> (known after apply)
      [33m~[0m[0m status                     = "running" -> (known after apply)
        [90m# (15 unchanged attributes hidden)[0m[0m

      [31m-[0m[0m network {
          [31m-[0m[0m alias_ips   = [] [90m-> null[0m[0m
          [31m-[0m[0m ip          = "10.255.0.101" [90m-> null[0m[0m
          [31m-[0m[0m mac_address = "86:00:00:a8:fc:3b" [90m-> null[0m[0m
          [31m-[0m[0m network_id  = 11370228 [90m-> null[0m[0m
        }
      [32m+[0m[0m network {
          [32m+[0m[0m alias_ips   = []
          [32m+[0m[0m ip          = "10.255.0.101"
          [32m+[0m[0m mac_address = (known after apply)
          [32m+[0m[0m network_id  = 11370228
        }

      [31m-[0m[0m public_net {
          [31m-[0m[0m ipv4         = 0 [90m-> null[0m[0m
          [31m-[0m[0m ipv4_enabled = true [90m-> null[0m[0m
          [31m-[0m[0m ipv6         = 0 [90m-> null[0m[0m
          [31m-[0m[0m ipv6_enabled = true [90m-> null[0m[0m
        }
      [32m+[0m[0m public_net {
          [32m+[0m[0m ipv4         = (known after apply)
          [32m+[0m[0m ipv4_enabled = true
          [32m+[0m[0m ipv6         = (known after apply)
          [32m+[0m[0m ipv6_enabled = true
        }
    }

[1m  # module.kube-hetzner.module.control_planes["0-0-control-plane-0"].null_resource.os_upgrade_toggle[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "os_upgrade_toggle" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "os_upgrade_state" = "enabled"
          [32m+[0m[0m "server_id"        = (known after apply)
        }
    }

[1m  # module.kube-hetzner.module.control_planes["0-0-control-plane-0"].null_resource.registries[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "registries" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "registries" = " "
        }
    }

[1m  # module.kube-hetzner.module.control_planes["0-0-control-plane-0"].null_resource.zram[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "zram" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "zram_size" = [90mnull[0m[0m
        }
    }

[1m  # module.kube-hetzner.module.control_planes["1-0-control-plane-1"].hcloud_server.server[0m is tainted, so must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "hcloud_server" "server" {
      [32m+[0m[0m backup_window              = (known after apply)
      [33m~[0m[0m datacenter                 = "nbg1-dc3" -> (known after apply)
      [33m~[0m[0m id                         = "107292776" -> (known after apply)
      [33m~[0m[0m ipv4_address               = "91.98.29.19" -> (known after apply)
      [33m~[0m[0m ipv6_address               = "2a01:4f8:c0c:7460::1" -> (known after apply)
      [33m~[0m[0m ipv6_network               = "2a01:4f8:c0c:7460::/64" -> (known after apply)
        name                       = "kube-baphomet-control-plane-1-jbp"
      [33m~[0m[0m primary_disk_size          = 40 -> (known after apply)
      [33m~[0m[0m status                     = "running" -> (known after apply)
        [90m# (15 unchanged attributes hidden)[0m[0m

      [31m-[0m[0m network {
          [31m-[0m[0m alias_ips   = [] [90m-> null[0m[0m
          [31m-[0m[0m ip          = "10.254.0.101" [90m-> null[0m[0m
          [31m-[0m[0m mac_address = "86:00:00:a8:fc:38" [90m-> null[0m[0m
          [31m-[0m[0m network_id  = 11370228 [90m-> null[0m[0m
        }
      [32m+[0m[0m network {
          [32m+[0m[0m alias_ips   = []
          [32m+[0m[0m ip          = "10.254.0.101"
          [32m+[0m[0m mac_address = (known after apply)
          [32m+[0m[0m network_id  = 11370228
        }

      [31m-[0m[0m public_net {
          [31m-[0m[0m ipv4         = 0 [90m-> null[0m[0m
          [31m-[0m[0m ipv4_enabled = true [90m-> null[0m[0m
          [31m-[0m[0m ipv6         = 0 [90m-> null[0m[0m
          [31m-[0m[0m ipv6_enabled = true [90m-> null[0m[0m
        }
      [32m+[0m[0m public_net {
          [32m+[0m[0m ipv4         = (known after apply)
          [32m+[0m[0m ipv4_enabled = true
          [32m+[0m[0m ipv6         = (known after apply)
          [32m+[0m[0m ipv6_enabled = true
        }
    }

[1m  # module.kube-hetzner.module.control_planes["1-0-control-plane-1"].null_resource.os_upgrade_toggle[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "os_upgrade_toggle" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "os_upgrade_state" = "enabled"
          [32m+[0m[0m "server_id"        = (known after apply)
        }
    }

[1m  # module.kube-hetzner.module.control_planes["1-0-control-plane-1"].null_resource.registries[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "registries" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "registries" = " "
        }
    }

[1m  # module.kube-hetzner.module.control_planes["1-0-control-plane-1"].null_resource.zram[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "zram" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "zram_size" = [90mnull[0m[0m
        }
    }

[1m  # module.kube-hetzner.module.control_planes["2-0-control-plane-2"].hcloud_server.server[0m is tainted, so must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "hcloud_server" "server" {
      [32m+[0m[0m backup_window              = (known after apply)
      [33m~[0m[0m datacenter                 = "hel1-dc2" -> (known after apply)
      [33m~[0m[0m id                         = "107292778" -> (known after apply)
      [33m~[0m[0m ipv4_address               = "95.216.160.119" -> (known after apply)
      [33m~[0m[0m ipv6_address               = "2a01:4f9:c012:f19::1" -> (known after apply)
      [33m~[0m[0m ipv6_network               = "2a01:4f9:c012:f19::/64" -> (known after apply)
        name                       = "kube-baphomet-control-plane-2-gwe"
      [33m~[0m[0m primary_disk_size          = 40 -> (known after apply)
      [33m~[0m[0m status                     = "running" -> (known after apply)
        [90m# (15 unchanged attributes hidden)[0m[0m

      [31m-[0m[0m network {
          [31m-[0m[0m alias_ips   = [] [90m-> null[0m[0m
          [31m-[0m[0m ip          = "10.253.0.101" [90m-> null[0m[0m
          [31m-[0m[0m mac_address = "86:00:00:a8:fc:34" [90m-> null[0m[0m
          [31m-[0m[0m network_id  = 11370228 [90m-> null[0m[0m
        }
      [32m+[0m[0m network {
          [32m+[0m[0m alias_ips   = []
          [32m+[0m[0m ip          = "10.253.0.101"
          [32m+[0m[0m mac_address = (known after apply)
          [32m+[0m[0m network_id  = 11370228
        }

      [31m-[0m[0m public_net {
          [31m-[0m[0m ipv4         = 0 [90m-> null[0m[0m
          [31m-[0m[0m ipv4_enabled = true [90m-> null[0m[0m
          [31m-[0m[0m ipv6         = 0 [90m-> null[0m[0m
          [31m-[0m[0m ipv6_enabled = true [90m-> null[0m[0m
        }
      [32m+[0m[0m public_net {
          [32m+[0m[0m ipv4         = (known after apply)
          [32m+[0m[0m ipv4_enabled = true
          [32m+[0m[0m ipv6         = (known after apply)
          [32m+[0m[0m ipv6_enabled = true
        }
    }

[1m  # module.kube-hetzner.module.control_planes["2-0-control-plane-2"].null_resource.os_upgrade_toggle[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "os_upgrade_toggle" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "os_upgrade_state" = "enabled"
          [32m+[0m[0m "server_id"        = (known after apply)
        }
    }

[1m  # module.kube-hetzner.module.control_planes["2-0-control-plane-2"].null_resource.registries[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "registries" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "registries" = " "
        }
    }

[1m  # module.kube-hetzner.module.control_planes["2-0-control-plane-2"].null_resource.zram[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "zram" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "zram_size" = [90mnull[0m[0m
        }
    }

[1mPlan:[0m 59 to add, 0 to change, 6 to destroy.
[0m
Changes to Outputs:
  [32m+[0m[0m agent_dns_names         = [
      [32m+[0m[0m (known after apply),
      [32m+[0m[0m (known after apply),
      [32m+[0m[0m (known after apply),
    ]
  [32m+[0m[0m agent_ips               = [
      [32m+[0m[0m (known after apply),
      [32m+[0m[0m (known after apply),
      [32m+[0m[0m (known after apply),
    ]
  [32m+[0m[0m control_plane_dns_names = [
      [32m+[0m[0m (known after apply),
      [32m+[0m[0m (known after apply),
      [32m+[0m[0m (known after apply),
    ]
  [32m+[0m[0m control_plane_ips       = [
      [32m+[0m[0m (known after apply),
      [32m+[0m[0m (known after apply),
      [32m+[0m[0m (known after apply),
    ]
  [32m+[0m[0m kubeconfig              = (sensitive value)
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @muchasxmaracas, Action: `pull_request`*